//=======================================================================================
//
//	  TGA ロードモジュール定義
//
//=======================================================================================

#ifndef _H_TGA
#define _H_TGA

//----- 構造体定義
typedef struct _TGAImage {	//--- TGA 用構造体
	unsigned sizeX, sizeY;		// ピクセル サイズ
	unsigned char *data;		// ピクセル データ
	unsigned type;				// ピクセル バイト長
	unsigned pixelDepth;		// ピクセル ビット長
	unsigned alphaDepth;		// アルファチャンネル ビット長
} TGAImage;

//----- プロトタイプ宣言
TGAImage *LoadTGA(const char *pszFName);

#endif	// _H_TGA

//=======================================================================================
//	End of Files
//=======================================================================================
